In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\payal\anaconda3\lib\site-packages (1.3.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\payal\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in c:\users\payal\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in c:\users\payal\anaconda3\lib\site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in c:\users\payal\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [80]:
import pandas as pd

In [81]:
df = pd.read_csv('data.csv')#creating dataframe by using csv

In [82]:
df

    id name   city    sal
0  101  abc  latur  25000
1  102  xyz   pune  45000

In [83]:
df1= pd.read_excel('test.xlsx')#creating dataframe by using xlsx

In [84]:
df1

  Unnamed: 0 Unnamed: 1 Unnamed: 2
0     empid     empname       esal
1        101      eeeee      50000
2        102       ffhk     650000
3        103      jfdfl      35000
4        104      bmcxv     679999

In [85]:
d=[  (101,'alok','pune',50000),
     (102,'shlok','mumbai',60000),
     (103,'sunil','banglore',65000),
     (104,'punit','solapur',55000),
     (105,'Jon','hyderabad',45000)
]

In [86]:
df=pd.DataFrame(data=d,columns=["id",'name','city','sal'])#creating dataframe by using tuple list

In [79]:
df

   prd_name  prd_id  prd_price prd_name  prd_id  prd_price
0    branze    4001      35000  Alumina    1001      65000
1  iron_ore    4002      45000     gold    1002      75000
2   boxiste    4003      89000   silver    1003      85000
3     steel    4004      34000   copper    1004      95000
4  platinum    4005      67000    metal    1005      55000

In [86]:
emp_data=[{'e_name':'payal','e_id':1001,'e_city':'pune'},
          {'e_name':'pooja','e_id':1002,'e_city':'Mumbai'},
          {'e_name':'komal','e_id':1003,'e_city':'Nagpur'},
          {'e_name':'jon','e_id':1004,'e_city':'Banglore'},
          {'e_name':'jyoti','e_id':1006,'e_city':'Chennai'},
          {'e_name':'Aakash','e_id':1007,'e_city':'Hyderabad'},
          
]

In [87]:
df1=pd.DataFrame(emp_data)

NameError: name 'emp_data' is not defined

In [25]:
df1.to_csv('practice.csv',index=False)

In [26]:
df1.to_json()

'{"e_name":{"0":"payal","1":"pooja","2":"komal","3":"jon","4":"jyoti","5":"Aakash"},"e_id":{"0":1001,"1":1002,"2":1003,"3":1004,"4":1006,"5":1007},"e_city":{"0":"pune","1":"Mumbai","2":"Nagpur","3":"Banglore","4":"Chennai","5":"Hyderabad"}}'

In [28]:
df1.to_html()

'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>e_name</th>\n      <th>e_id</th>\n      <th>e_city</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>payal</td>\n      <td>1001</td>\n      <td>pune</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>pooja</td>\n      <td>1002</td>\n      <td>Mumbai</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>komal</td>\n      <td>1003</td>\n      <td>Nagpur</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>jon</td>\n      <td>1004</td>\n      <td>Banglore</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>jyoti</td>\n      <td>1006</td>\n      <td>Chennai</td>\n    </tr>\n    <tr>\n      <th>5</th>\n      <td>Aakash</td>\n      <td>1007</td>\n      <td>Hyderabad</td>\n    </tr>\n  </tbody>\n</table>'

In [29]:
df1.to_dict()

{'e_name': {0: 'payal',
  1: 'pooja',
  2: 'komal',
  3: 'jon',
  4: 'jyoti',
  5: 'Aakash'},
 'e_id': {0: 1001, 1: 1002, 2: 1003, 3: 1004, 4: 1006, 5: 1007},
 'e_city': {0: 'pune',
  1: 'Mumbai',
  2: 'Nagpur',
  3: 'Banglore',
  4: 'Chennai',
  5: 'Hyderabad'}}

In [49]:
df

    id name   city    sal
0  101  abc  latur  25000
1  102  xyz   pune  45000

In [51]:
df.shape# shape in no. of rows and columns

(2, 4)

In [52]:
df1.shape

(6, 3)

In [55]:
df.describe()#description

               id           sal
count    2.000000      2.000000
mean   101.500000  35000.000000
std      0.707107  14142.135624
min    101.000000  25000.000000
25%    101.250000  30000.000000
50%    101.500000  35000.000000
75%    101.750000  40000.000000
max    102.000000  45000.000000

In [56]:
df.dtypes#datatypes of feature

id       int64
name    object
city    object
sal      int64
dtype: object

In [57]:
df1.head()#to fetch first 5 records

  e_name  e_id    e_city
0  payal  1001      pune
1  pooja  1002    Mumbai
2  komal  1003    Nagpur
3    jon  1004  Banglore
4  jyoti  1006   Chennai

In [61]:
df1.tail()#to fetch last 5 records

   e_name  e_id     e_city
1   pooja  1002     Mumbai
2   komal  1003     Nagpur
3     jon  1004   Banglore
4   jyoti  1006    Chennai
5  Aakash  1007  Hyderabad

In [66]:
len(df1['e_city'])#to check lenghth of perticular feature

6

In [71]:
df1['e_id']#to fetch perticular feature

0    1001
1    1002
2    1003
3    1004
4    1006
5    1007
Name: e_id, dtype: int64

In [76]:
df1[['e_city','e_name']]# to fetch multiple features

      e_city  e_name
0       pune   payal
1     Mumbai   pooja
2     Nagpur   komal
3   Banglore     jon
4    Chennai   jyoti
5  Hyderabad  Aakash

In [90]:
df1['e_id'].value_counts()

1001    1
1002    1
1003    1
1004    1
1006    1
1007    1
Name: e_id, dtype: int64

In [91]:
df1['e_name'].unique()

array(['payal', 'pooja', 'komal', 'jon', 'jyoti', 'Aakash'], dtype=object)

In [77]:
df1

   prd_name  prd_id  prd_price
0    branze    4001      35000
1  iron_ore    4002      45000
2   boxiste    4003      89000
3     steel    4004      34000
4  platinum    4005      67000
5   Alumina    1001      65000
6      gold    1002      75000
7    silver    1003      85000
8    copper    1004      95000
9     metal    1005      55000

In [92]:
df1.columns

Index(['e_name', 'e_id', 'e_city'], dtype='object')

In [93]:
df1['e_sal']=50000

In [94]:
df1

   e_name  e_id     e_city  e_sal
0   payal  1001       pune  50000
1   pooja  1002     Mumbai  50000
2   komal  1003     Nagpur  50000
3     jon  1004   Banglore  50000
4   jyoti  1006    Chennai  50000
5  Aakash  1007  Hyderabad  50000

In [95]:
df1['e_company']='IBM'#to add single feature in df

In [96]:
df1

   e_name  e_id     e_city  e_sal e_company
0   payal  1001       pune  50000       IBM
1   pooja  1002     Mumbai  50000       IBM
2   komal  1003     Nagpur  50000       IBM
3     jon  1004   Banglore  50000       IBM
4   jyoti  1006    Chennai  50000       IBM
5  Aakash  1007  Hyderabad  50000       IBM

In [104]:
df1.drop('e_company',axis=1)#to remove single feature from df

KeyError: "['e_company'] not found in axis"

In [105]:
df1.drop(columns=['e_name','e_sal'],axis=1,inplace=True)#to remove multiple features from df

KeyError: "['e_name' 'e_sal'] not found in axis"

In [100]:
df1

   e_id     e_city e_company
0  1001       pune       IBM
1  1002     Mumbai       IBM
2  1003     Nagpur       IBM
3  1004   Banglore       IBM
4  1006    Chennai       IBM
5  1007  Hyderabad       IBM

In [106]:
#how to del whole df
del df1

In [107]:
df1

NameError: name 'df1' is not defined

In [1]:
 prd=[{'prd_name':'Alumina','prd_id':1001,'prd_price':65000},
        {'prd_name':'gold','prd_id':1002,'prd_price':75000},
        {'prd_name':'silver','prd_id':1003,'prd_price':85000},
        {'prd_name':'copper','prd_id':1004,'prd_price':95000},
        {'prd_name':'metal','prd_id':1005,'prd_price':55000},
        
 ]

In [3]:
import pandas as pd

In [4]:
df_us=pd.DataFrame(prd)

In [5]:
df_us

  prd_name  prd_id  prd_price
0  Alumina    1001      65000
1     gold    1002      75000
2   silver    1003      85000
3   copper    1004      95000
4    metal    1005      55000

In [6]:
prd1=prd=[{'prd_name':'branze','prd_id':4001,'prd_price':35000},
        {'prd_name':'iron_ore','prd_id':4002,'prd_price':45000},
        {'prd_name':'boxiste','prd_id':4003,'prd_price':89000},
        {'prd_name':'steel','prd_id':4004,'prd_price':34000},
        {'prd_name':'platinum','prd_id':4005,'prd_price':67000},
        
 ]

In [7]:
df_uk=pd.DataFrame(prd1)

In [8]:
df_uk

   prd_name  prd_id  prd_price
0    branze    4001      35000
1  iron_ore    4002      45000
2   boxiste    4003      89000
3     steel    4004      34000
4  platinum    4005      67000

In [16]:
df1=pd.concat([df_uk,df_us])

In [17]:
df1

   prd_name  prd_id  prd_price
0    branze    4001      35000
1  iron_ore    4002      45000
2   boxiste    4003      89000
3     steel    4004      34000
4  platinum    4005      67000
0   Alumina    1001      65000
1      gold    1002      75000
2    silver    1003      85000
3    copper    1004      95000
4     metal    1005      55000

In [29]:
df1=pd.concat([df_uk,df_us],ignore_index=True)#vertically concat 
#ignore_index=True it will arrange index 0,1,2,3,4,5,df6....likewise

In [33]:
df1

   prd_name  prd_id  prd_price
0    branze    4001      35000
1  iron_ore    4002      45000
2   boxiste    4003      89000
3     steel    4004      34000
4  platinum    4005      67000
5   Alumina    1001      65000
6      gold    1002      75000
7    silver    1003      85000
8    copper    1004      95000
9     metal    1005      55000

In [34]:
df=pd.concat([df_uk,df_us],axis=1)#horizontally concat when we set axis=1 parameter

In [35]:
df.drop(2)#it will deletes 2nd index row

   prd_name  prd_id  prd_price prd_name  prd_id  prd_price
0    branze    4001      35000  Alumina    1001      65000
1  iron_ore    4002      45000     gold    1002      75000
3     steel    4004      34000   copper    1004      95000
4  platinum    4005      67000    metal    1005      55000

In [36]:
df1

   prd_name  prd_id  prd_price
0    branze    4001      35000
1  iron_ore    4002      45000
2   boxiste    4003      89000
3     steel    4004      34000
4  platinum    4005      67000
5   Alumina    1001      65000
6      gold    1002      75000
7    silver    1003      85000
8    copper    1004      95000
9     metal    1005      55000

In [37]:
df1.set_index('prd_name',inplace=True)#we can also set custom index

In [38]:
df1

          prd_id  prd_price
prd_name
branze      4001      35000
iron_ore    4002      45000
boxiste     4003      89000
steel       4004      34000
platinum    4005      67000
Alumina     1001      65000
gold        1002      75000
silver      1003      85000
copper      1004      95000
metal       1005      55000

In [39]:
df1.reset_index('prd_name',inplace=True)

In [40]:
df1

   prd_name  prd_id  prd_price
0    branze    4001      35000
1  iron_ore    4002      45000
2   boxiste    4003      89000
3     steel    4004      34000
4  platinum    4005      67000
5   Alumina    1001      65000
6      gold    1002      75000
7    silver    1003      85000
8    copper    1004      95000
9     metal    1005      55000

In [74]:
df

   prd_name  prd_id  prd_price prd_name  prd_id  prd_price
0    branze    4001      35000  Alumina    1001      65000
1  iron_ore    4002      45000     gold    1002      75000
2   boxiste    4003      89000   silver    1003      85000
3     steel    4004      34000   copper    1004      95000
4  platinum    4005      67000    metal    1005      55000

In [43]:
df_uk

   prd_name  prd_id  prd_price
0    branze    4001      35000
1  iron_ore    4002      45000
2   boxiste    4003      89000
3     steel    4004      34000
4  platinum    4005      67000

In [46]:
df_uk.loc[:,['prd_name','prd_id']]#inside loc we need to specify actual column name

   prd_name  prd_id
0    branze    4001
1  iron_ore    4002
2   boxiste    4003
3     steel    4004
4  platinum    4005

In [47]:
df_uk.loc[2:4,['prd_id','prd_price']]#we can fetch perticular part of dataframe by using loc and iloc

   prd_id  prd_price
2    4003      89000
3    4004      34000
4    4005      67000

In [51]:
df_uk.loc[1,'prd_name':'prd_price']

prd_name     iron_ore
prd_id           4002
prd_price       45000
Name: 1, dtype: object

In [49]:
df_uk.loc[:,['prd_name']]

   prd_name
0    branze
1  iron_ore
2   boxiste
3     steel
4  platinum

In [52]:
df_uk.loc[1,['prd_name','prd_id']]

prd_name    iron_ore
prd_id          4002
Name: 1, dtype: object

In [53]:
df_uk.loc[1:3,'prd_name':'prd_price']

   prd_name  prd_id  prd_price
1  iron_ore    4002      45000
2   boxiste    4003      89000
3     steel    4004      34000

In [55]:
df_uk.loc[:,'prd_name':'prd_price']

   prd_name  prd_id  prd_price
0    branze    4001      35000
1  iron_ore    4002      45000
2   boxiste    4003      89000
3     steel    4004      34000
4  platinum    4005      67000

In [56]:
#### in iloc indexing is used instead of actual column name

In [57]:
df_us

  prd_name  prd_id  prd_price
0  Alumina    1001      65000
1     gold    1002      75000
2   silver    1003      85000
3   copper    1004      95000
4    metal    1005      55000

In [59]:
df_us.iloc[1:4,0:1]#in iloc stop is excluded that is -1

  prd_name
1     gold
2   silver
3   copper

In [60]:
df_us.iloc[:,1:4]

   prd_id  prd_price
0    1001      65000
1    1002      75000
2    1003      85000
3    1004      95000
4    1005      55000

In [61]:
df_us.iloc[0,0:3]

prd_name     Alumina
prd_id          1001
prd_price      65000
Name: 0, dtype: object

In [62]:
df_us.iloc[0:2,0:3]

  prd_name  prd_id  prd_price
0  Alumina    1001      65000
1     gold    1002      75000

In [63]:
df_us.iloc[0:5,0]

0    Alumina
1       gold
2     silver
3     copper
4      metal
Name: prd_name, dtype: object

In [64]:
df_us.info()#for dataframe info it is similar to value_counts()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   prd_name   5 non-null      object
 1   prd_id     5 non-null      int64
 2   prd_price  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [65]:
df_us.value_counts

<bound method DataFrame.value_counts of   prd_name  prd_id  prd_price
0  Alumina    1001      65000
1     gold    1002      75000
2   silver    1003      85000
3   copper    1004      95000
4    metal    1005      55000>

In [66]:
##how to change datatype of column
df_us['newcol']=df_us['prd_price'].astype('float64')

In [67]:
df_us

  prd_name  prd_id  prd_price   newcol
0  Alumina    1001      65000  65000.0
1     gold    1002      75000  75000.0
2   silver    1003      85000  85000.0
3   copper    1004      95000  95000.0
4    metal    1005      55000  55000.0

In [69]:
df_us.isnull().sum()# to check null values here is no null values

prd_name     0
prd_id       0
prd_price    0
newcol       0
dtype: int64

In [70]:
df_us['prd_price'].mean()#average

75000.0

In [71]:
df_us['prd_price'].min()#minimum

55000

In [72]:
df_us['prd_price'].max()#maximum

95000

In [73]:
df_us['prd_price'].std()#standard deviation

15811.388300841896

In [75]:
df

   prd_name  prd_id  prd_price prd_name  prd_id  prd_price
0    branze    4001      35000  Alumina    1001      65000
1  iron_ore    4002      45000     gold    1002      75000
2   boxiste    4003      89000   silver    1003      85000
3     steel    4004      34000   copper    1004      95000
4  platinum    4005      67000    metal    1005      55000

In [76]:
df.drop_duplicates()#for removing duplicates

   prd_name  prd_id  prd_price prd_name  prd_id  prd_price
0    branze    4001      35000  Alumina    1001      65000
1  iron_ore    4002      45000     gold    1002      75000
2   boxiste    4003      89000   silver    1003      85000
3     steel    4004      34000   copper    1004      95000
4  platinum    4005      67000    metal    1005      55000

In [26]:
df=pd.read_csv('weather.csv')

In [27]:
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [96]:
df1=(df['city']!='beijing') & (df['city']!='new york')

In [97]:
df1

0    False
1    False
2    False
3     True
4     True
5     True
6    False
7    False
8    False
Name: city, dtype: bool

In [98]:
df1[~(df['city']=='beijing')]

0    False
1    False
2    False
3     True
4     True
5     True
Name: city, dtype: bool

In [106]:
df=pd.read_csv('data.csv')

In [107]:
df

    id name   city    sal
0  101  abc  latur  25000
1  102  xyz   pune  45000

In [108]:
df1=['city']!='latur'

In [109]:
df1

True

In [110]:
type(df)

pandas.core.frame.DataFrame

In [120]:
d={'id':[103],'name':['payal'],'sal':[50000]}#add perticular record in dataframe
df1=pd.DataFrame(d)
pd.concat([df,df1],ignore_index=True)  #add row in dataframe

    id   name   city    sal
0  101    abc  latur  25000
1  102    xyz   pune  45000
2  103  payal    NaN  50000

In [1]:
import pandas as pd

In [3]:
d={'id':['A','B','C','D'],
    'city':['pune','Mumbai','banglore','chennai'],
    }

In [4]:
df1=pd.DataFrame(d)

In [5]:
a={'id':['A','B','C','D','E','F'],
    'sal':[10000,20000,30000,40000,50000,600000],
    }

In [6]:
df2=pd.DataFrame(a)

In [7]:
df1

  id      city
0  A      pune
1  B    Mumbai
2  C  banglore
3  D   chennai

In [8]:
df2

  id     sal
0  A   10000
1  B   20000
2  C   30000
3  D   40000
4  E   50000
5  F  600000

In [12]:
df3=pd.merge(df1,df2, on='id')#join on two dataframes

In [13]:
df3

  id      city    sal
0  A      pune  10000
1  B    Mumbai  20000
2  C  banglore  30000
3  D   chennai  40000

In [17]:
df4=pd.merge(df1,df2, on='id',how='left', indicator=True)

In [15]:
df4

  id      city    sal _merge
0  A      pune  10000   both
1  B    Mumbai  20000   both
2  C  banglore  30000   both
3  D   chennai  40000   both

In [21]:
df=pd.merge(df1,df2, on='id',how='right', indicator=True)

In [22]:
df5=pd.merge(df1,df2, on='id',how='right', indicator=True)#indicator indicates from which table
##records are comming

In [23]:
df5

  id      city     sal      _merge
0  A      pune   10000        both
1  B    Mumbai   20000        both
2  C  banglore   30000        both
3  D   chennai   40000        both
4  E       NaN   50000  right_only
5  F       NaN  600000  right_only

In [24]:
df6=pd.merge(df1,df2, on='id',how='outer', indicator=True)

In [25]:
df6

  id      city     sal      _merge
0  A      pune   10000        both
1  B    Mumbai   20000        both
2  C  banglore   30000        both
3  D   chennai   40000        both
4  E       NaN   50000  right_only
5  F       NaN  600000  right_only

In [28]:
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [29]:
obj=df.groupby('city')

In [30]:
obj.get_group('new york')# group by is used to make group of similer categories

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60

In [31]:
obj.get_group('beijing')

       date     city  temperature  humidity
6  5/1/2017  beijing           80        26
7  5/2/2017  beijing           77        30
8  5/3/2017  beijing           79        35

In [1]:
 import pandas as pd

In [85]:
df=pd.read_csv('weather.csv')

In [3]:
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [4]:
df['city']

0    new york
1    new york
2    new york
3      mumbai
4      mumbai
5      mumbai
6     beijing
7     beijing
8     beijing
Name: city, dtype: object

In [21]:
df['newcol']='IBM'

In [6]:
df

       date      city  temperature  humidity newcol
0  5/1/2017  new york           65        56    IBM
1  5/2/2017  new york           66        58    IBM
2  5/3/2017  new york           68        60    IBM
3  5/1/2017    mumbai           75        80    IBM
4  5/2/2017    mumbai           78        83    IBM
5  5/3/2017    mumbai           82        85    IBM
6  5/1/2017   beijing           80        26    IBM
7  5/2/2017   beijing           77        30    IBM
8  5/3/2017   beijing           79        35    IBM

In [20]:
df.drop('newcol',axis=1)

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [22]:
df

       date      city  temperature  humidity newcol
0  5/1/2017  new york           65        56    IBM
1  5/2/2017  new york           66        58    IBM
2  5/3/2017  new york           68        60    IBM
3  5/1/2017    mumbai           75        80    IBM
4  5/2/2017    mumbai           78        83    IBM
5  5/3/2017    mumbai           82        85    IBM
6  5/1/2017   beijing           80        26    IBM
7  5/2/2017   beijing           77        30    IBM
8  5/3/2017   beijing           79        35    IBM

In [23]:
df.drop(columns=['date','newcol'],axis=1)

       city  temperature  humidity
0  new york           65        56
1  new york           66        58
2  new york           68        60
3    mumbai           75        80
4    mumbai           78        83
5    mumbai           82        85
6   beijing           80        26
7   beijing           77        30
8   beijing           79        35

In [24]:
df.loc[0]

date           5/1/2017
city           new york
temperature          65
humidity             56
newcol              IBM
Name: 0, dtype: object

In [27]:
df.loc[:,'city':'humidity']

       city  temperature  humidity
0  new york           65        56
1  new york           66        58
2  new york           68        60
3    mumbai           75        80
4    mumbai           78        83
5    mumbai           82        85
6   beijing           80        26
7   beijing           77        30
8   beijing           79        35

In [28]:
df.loc[:,['city','humidity']]

       city  humidity
0  new york        56
1  new york        58
2  new york        60
3    mumbai        80
4    mumbai        83
5    mumbai        85
6   beijing        26
7   beijing        30
8   beijing        35

In [29]:
df.head()

       date      city  temperature  humidity newcol
0  5/1/2017  new york           65        56    IBM
1  5/2/2017  new york           66        58    IBM
2  5/3/2017  new york           68        60    IBM
3  5/1/2017    mumbai           75        80    IBM
4  5/2/2017    mumbai           78        83    IBM

In [30]:
df.tail()

       date     city  temperature  humidity newcol
4  5/2/2017   mumbai           78        83    IBM
5  5/3/2017   mumbai           82        85    IBM
6  5/1/2017  beijing           80        26    IBM
7  5/2/2017  beijing           77        30    IBM
8  5/3/2017  beijing           79        35    IBM

In [31]:
df.shape

(9, 5)

In [32]:
df.dtypes

date           object
city           object
temperature     int64
humidity        int64
newcol         object
dtype: object

In [33]:
df.describe()

       temperature   humidity
count     9.000000   9.000000
mean     74.444444  57.000000
std       6.424778  22.841848
min      65.000000  26.000000
25%      68.000000  35.000000
50%      77.000000  58.000000
75%      79.000000  80.000000
max      82.000000  85.000000

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         9 non-null      object
 1   city         9 non-null      object
 2   temperature  9 non-null      int64
 3   humidity     9 non-null      int64
 4   newcol       9 non-null      object
dtypes: int64(2), object(3)
memory usage: 488.0+ bytes

In [35]:
df.['city'].unique()

SyntaxError: invalid syntax (Temp/ipykernel_20976/4130513314.py, line 1)

In [83]:
df

    id   name   city
0  101  payal  latur

In [37]:
df['city'].unique()

array(['new york', 'mumbai', 'beijing'], dtype=object)

In [38]:
df['city'].value_counts()

new york    3
mumbai      3
beijing     3
Name: city, dtype: int64

In [39]:
df.isnull().sum()

date           0
city           0
temperature    0
humidity       0
newcol         0
dtype: int64

In [40]:
df

       date      city  temperature  humidity newcol
0  5/1/2017  new york           65        56    IBM
1  5/2/2017  new york           66        58    IBM
2  5/3/2017  new york           68        60    IBM
3  5/1/2017    mumbai           75        80    IBM
4  5/2/2017    mumbai           78        83    IBM
5  5/3/2017    mumbai           82        85    IBM
6  5/1/2017   beijing           80        26    IBM
7  5/2/2017   beijing           77        30    IBM
8  5/3/2017   beijing           79        35    IBM

In [43]:
df.columns

Index(['date', 'city', 'temperature', 'humidity', 'newcol'], dtype='object')

In [45]:
df.iloc[:,1:4]

       city  temperature  humidity
0  new york           65        56
1  new york           66        58
2  new york           68        60
3    mumbai           75        80
4    mumbai           78        83
5    mumbai           82        85
6   beijing           80        26
7   beijing           77        30
8   beijing           79        35

In [46]:
df.iloc[1:5,0:2]

       date      city
1  5/2/2017  new york
2  5/3/2017  new york
3  5/1/2017    mumbai
4  5/2/2017    mumbai

In [47]:
d={'id':[101,102,103,104,105],
  'city':['pune','Mumbai','delhi','chennai','hyderabad']}

In [48]:
df=pd.DataFrame(d)

In [49]:
df

    id       city
0  101       pune
1  102     Mumbai
2  103      delhi
3  104    chennai
4  105  hyderabad

In [50]:
a={'id':[101,102,103,104,105,106,107],
  'sal':[34000,50000,40000,25000,50000,60000,65000]}

In [51]:
df1=pd.DataFrame(a)

In [52]:
df1

    id    sal
0  101  34000
1  102  50000
2  103  40000
3  104  25000
4  105  50000
5  106  60000
6  107  65000

In [53]:
pd.merge(df,df1, on='id', how='right',indicator=True)

    id       city    sal      _merge
0  101       pune  34000        both
1  102     Mumbai  50000        both
2  103      delhi  40000        both
3  104    chennai  25000        both
4  105  hyderabad  50000        both
5  106        NaN  60000  right_only
6  107        NaN  65000  right_only

In [54]:
z=[(101,'payal','pune'),
  (102,'abhi','Latur')]

In [55]:
df1=pd.DataFrame(data=z,columns=['id','name','city'])

In [56]:
df1

    id   name   city
0  101  payal   pune
1  102   abhi  Latur

In [62]:
x=[{'id':103,'name':'abc','city':'latur'},
    {'id':104,'name':'xyz','city':'pune'}]

In [63]:
df2=pd.DataFrame(x)

In [64]:
df2

    id name   city
0  103  abc  latur
1  104  xyz   pune

In [73]:
df3=pd.concat([df1,df2],ignore_index='True')

In [74]:
df3=pd.concat([df1,df2])

In [80]:
d={'id':[101],'name':['payal'],'city':['latur']}

In [81]:
df=pd.DataFrame(d)

In [82]:
pd.concat([df2,df])

    id   name   city
0  103    abc  latur
1  104    xyz   pune
0  101  payal  latur

In [84]:
df

    id   name   city
0  101  payal  latur

In [86]:
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [87]:
obj=df.groupby('city')
obj.get_group('mumbai')

       date    city  temperature  humidity
3  5/1/2017  mumbai           75        80
4  5/2/2017  mumbai           78        83
5  5/3/2017  mumbai           82        85